#!/bin/bash

# Проверяем наличие файла образа
if [ -f "nodemodbus.tar" ]; then
    # Загружаем образ из файла
    echo "Загрузка образа из файла..."
    docker load < nodemodbus.tar
    
    if [ $? -eq 0 ]; then
        echo "Запуск контейнера..."
        docker-compose up -d
        
        if [ $? -eq 0 ]; then
            echo "Система запущена, проверка работоспособности..."
            # Ждем 5 секунд для полного запуска
            sleep 5
            
            # Проверяем доступность API
            response=$(curl -s -w "%{http_code}" http://localhost:3000/api/current -o /dev/null)
            
            if [ "$response" == "200" ]; then
                echo "✅ Система успешно запущена и отвечает на запросы, по умолчанию порт веб-сервера 3000"
                echo "📊 Метрики доступны по адресу: http://localhost:3000/metrics.html"
                echo "📢 Для остановки системы - отправьте команду: docker-compose down"
                echo "📄 Для просмотра логов - отправьте команду: docker logs nodemodbus"
            else
                echo "❌ Система запущена, но не отвечает на запросы"
                echo "Проверьте логи: docker logs nodemodbus"
                exit 1
            fi
        else
            echo "Ошибка при запуске контейнера"
            exit 1
        fi
    else
        echo "Ошибка при загрузке образа"
        exit 1
    fi
else
    echo "Ошибка: файл nodemodbus.tar не найден"
    echo "Убедитесь что у вас есть:"
    echo "- nodemodbus.tar"
    echo "- docker-compose.yml"
    echo "Если файла .tar нет - выполните команду 'docker pull vvagafonov/nodemodbus:latest' а затем 'docker save nodemodbus:latest > nodemodbus.tar'"
    echo "и попробуйте снова ;) "
    exit 1
fi